KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x motor 2.h
/**
  ******************************************************************************
  * @file    Parameters conversion_F30X motor 2.h
  * @author  STMicroelectronics - System Lab - MC Team
  * @version 4.0.0
  * @date    28-May-2014 10:45
  * @brief   This file implements the Parameter conversion on the base
  *          of stdlib F30x for the second drive
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PARAMETERS_CONVERSION_F30X_MOTOR2_H
#define __PARAMETERS_CONVERSION_F30X_MOTOR2_H

#include "Definitions.h"
#include "PMSM motor 2 parameters.h"
#include "Drive parameters motor 2.h"
#include "Power stage parameters motor 2.h"
#include "Control stage parameters motor 2.h"
#include "stm32f30x.h"

#include "Power stage parameters.h"
/************************* CPU & ADC PERIPHERAL CLOCK CONFIG ******************/

#ifndef ADC_CLOCK_WB_DIV2
#define ADC_CLOCK_WB_DIV2  1
#endif

#if (ADC_CLOCK_WB_DIV2 == 0)
#undef ADC_CLOCK_WB_DIV2
#define ADC_CLOCK_WB_DIV2 1
#endif

#if   (ADC_CLOCK_WB_DIV2 == 1)
#define ADC_CLOCK_DIVIDER2  ADC_Clock_SynClkModeDiv1
#elif (ADC_CLOCK_WB_DIV2 == 2)
#define ADC_CLOCK_DIVIDER2  ADC_Clock_SynClkModeDiv2
#elif (ADC_CLOCK_WB_DIV2 == 4)
#define ADC_CLOCK_DIVIDER2  ADC_Clock_SynClkModeDiv4
#endif

#define ADC_CLOCK_DIV2      ADC_CLOCK_WB_DIV2

#if defined CPU_CLK_72_MHZ
#define TIM_CLOCK_DIVIDER2  1
#define ADV_TIM_CLK_MHz2    (72uL/TIM_CLOCK_DIVIDER2)
#define ADC_CLK_MHz2        (72uL/ADC_CLOCK_DIV2)
#define HALL_TIM_CLK2       SYSCLK_FREQ_72MHz

#elif defined CPU_CLK_56_MHZ
#define TIM_CLOCK_DIVIDER2  1
#define ADV_TIM_CLK_MHz2    (56uL/TIM_CLOCK_DIVIDER2)
#define ADC_CLK_MHz2        (56uL/ADC_CLOCK_DIV2)
#define HALL_TIM_CLK2       SYSCLK_FREQ_56MHz

#elif defined CPU_CLK_48_MHZ
#define TIM_CLOCK_DIVIDER2  1
#define ADV_TIM_CLK_MHz2    (48uL/TIM_CLOCK_DIVIDER2)
#define ADC_CLK_MHz2        (48uL/ADC_CLOCK_DIV2)
#define HALL_TIM_CLK2       SYSCLK_FREQ_48MHz

#elif defined CPU_CLK_24_MHZ
#define TIM_CLOCK_DIVIDER2  1
#define ADV_TIM_CLK_MHz2    (24uL/TIM_CLOCK_DIVIDER2)
#define ADC_CLK_MHz2        (24uL/ADC_CLOCK_DIV2)
#define HALL_TIM_CLK2       SYSCLK_FREQ_24MHz
#else
#endif

/************************* CONTROL FREQUENCIES & DELAIES **********************/
#define TF_REGULATION_RATE2 	(uint16_t) ((uint16_t)(PWM_FREQUENCY2)/REGULATION_EXECUTION_RATE2)
#define REP_COUNTER2 			(uint16_t) ((REGULATION_EXECUTION_RATE2 *2)-1u)

#define MEDIUM_FREQUENCY_TASK_RATE2		(uint16_t)SPEED_LOOP_FREQUENCY_HZ2

#define INRUSH_CURRLIMIT_DELAY_COUNTS2  (uint16_t)(INRUSH_CURRLIMIT_DELAY_MS2 * \
				   ((uint16_t)SPEED_LOOP_FREQUENCY_HZ)/1000u -1u)

#define MF_TASK_OCCURENCE_TICKS2  (SYS_TICK_FREQUENCY/MEDIUM_FREQUENCY_TASK_RATE2)-1u


/************ SENSORLESS REV-UP PARAMETERS ************************************/
#define FIRST_SLESS_ALGO_PHASE2 (ENABLE_SL_ALGO_FROM_PHASE2-1u)  
#if OPEN_LOOP_FOC2 == ENABLE

#define OPEN_LOOP2
#undef DEFAULT_TARGET_SPEED_RPM2
#define DEFAULT_TARGET_SPEED_RPM2       OPEN_LOOP_SPEED_RPM2

#undef PHASE1_DURATION2
#undef PHASE2_DURATION2
#undef PHASE3_DURATION2
#undef PHASE4_DURATION2
#undef PHASE5_DURATION2

#undef PHASE1_FINAL_SPEED_RPM2
#undef PHASE2_FINAL_SPEED_RPM2
#undef PHASE3_FINAL_SPEED_RPM2
#undef PHASE4_FINAL_SPEED_RPM2
#undef PHASE5_FINAL_SPEED_RPM2

#undef VARIANCE_THRESHOLD2
#undef CORD_VARIANCE_THRESHOLD2

/* Phase 1 */
#define PHASE1_DURATION2		    OPEN_LOOP_SPEED_RAMP_DURATION_MS2
#define PHASE1_FINAL_SPEED_RPM2	    OPEN_LOOP_SPEED_RPM2
/* Phase 2 */
#define PHASE2_DURATION2		  65535   /*milliseconds */
#define PHASE2_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 3 */
#define PHASE3_DURATION2		  65535   /*milliseconds */
#define PHASE3_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 4 */
#define PHASE4_DURATION2		  65535   /*milliseconds */
#define PHASE4_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 5 */
#define PHASE5_DURATION2		  65535    /* milliseconds */
#define PHASE5_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2

#define VARIANCE_THRESHOLD2       0
#define CORD_VARIANCE_THRESHOLD2  0
#endif

/* Legacy for WB 4.0 Beta */
#if !defined(OPEN_LOOP_VF2)
#define OPEN_LOOP_VF2 FALSE
#endif
#if !defined(OPEN_LOOP_OFF2)
#define OPEN_LOOP_OFF2 4400
#endif
#if !defined(OPEN_LOOP_K2)
#define OPEN_LOOP_K2 44
#endif

/************************* OBSERVER PARAMETERS ********************************/
#define MAX_BEMF_VOLTAGE2  (uint16_t)((1.2*MAX_APPLICATION_SPEED2 *\
                           MOTOR_VOLTAGE_CONSTANT2*SQRT_2)/(1000u*SQRT_3))

#if (BUS_VOLTAGE_READING2 == ENABLE)
/*max phase voltage, 0-peak Volts*/
#define MAX_VOLTAGE2 (int16_t)((MCU_SUPPLY_VOLTAGE/2)/BUS_ADC_CONV_RATIO2) 
#else
#define MAX_VOLTAGE2 (int16_t)(500/2) /* Virtual sensor conversion factor */
#endif

#ifdef ICS_SENSORS2 
#define MAX_CURRENT2 (MCU_SUPPLY_VOLTAGE/(2*AMPLIFICATION_GAIN2))
#else
#define MAX_CURRENT2 (MCU_SUPPLY_VOLTAGE/(2*RSHUNT2*AMPLIFICATION_GAIN2))
#endif

#define C12 (int32_t)((((int16_t)F12)*RS2)/(LS2*TF_REGULATION_RATE2))
#define C22 (int32_t) GAIN12
#define C32 (int32_t)((((int16_t)F12)*MAX_BEMF_VOLTAGE2)/(LS2*MAX_CURRENT2*TF_REGULATION_RATE2))
#define C42 (int32_t) GAIN22
#define C52 (int32_t)((((int16_t)F12)*MAX_VOLTAGE2)/(LS2*MAX_CURRENT2*TF_REGULATION_RATE2))

#define FREQ_STARTUP_PWM_STEPS2 (uint32_t) ((FREQ_START_UP_DURATION2 * TF_REGULATION_RATE2)\
                                                                          /1000u) 
#define FREQ_INC2 (uint16_t) ((FINAL_START_UP_SPEED2*POLE_PAIR_NUM2*65536u/60u)\
                                                        /FREQ_STARTUP_PWM_STEPS2)
#define I_STARTUP_PWM_STEPS2 (uint32_t) ((I_START_UP_DURATION2 * TF_REGULATION_RATE2)/1000u) 
#define I_INC2 (uint16_t)((FINAL_I_STARTUP2 -FIRST_I_STARTUP2)*1024u/I_STARTUP_PWM_STEPS2)
#define PERCENTAGE_FACTOR2    (uint16_t)(VARIANCE_THRESHOLD2*128u)      
#define OBS_MINIMUM_SPEED2        (uint16_t) (OBS_MINIMUM_SPEED_RPM2/6u)

/*********************** OBSERVER + CORDIC PARAMETERS *************************/
#define CORD_C12 (int32_t)((((int16_t)CORD_F12)*RS)/(LS*TF_REGULATION_RATE))
#define CORD_C22 (int32_t) CORD_GAIN12
#define CORD_C32 (int32_t)((((int16_t)CORD_F12)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT\
                                                           *TF_REGULATION_RATE))
#define CORD_C42 (int32_t) CORD_GAIN2
#define CORD_C52 (int32_t)((((int16_t)CORD_F12)*MAX_VOLTAGE2)/(LS2*MAX_CURRENT2*\
                                                          TF_REGULATION_RATE2))
#define CORD_PERCENTAGE_FACTOR2    (uint16_t)(CORD_VARIANCE_THRESHOLD2*128u)      
#define CORD_MINIMUM_SPEED2        (uint16_t) (CORD_MINIMUM_SPEED_RPM2/6u)

