KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x motor 2.h
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO2       VBUS_PARTITIONING_FACTOR2

#define OVERVOLTAGE_THRESHOLD_d2   (uint16_t)(OV_VOLTAGE_THRESHOLD_V2*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR2))
#define UNDERVOLTAGE_THRESHOLD_d2  (uint16_t)((UD_VOLTAGE_THRESHOLD_V2*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO2)))

#define INT_SUPPLY_VOLTAGE2          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD2        (OV_TEMPERATURE_THRESHOLD_C2- T0_C2)
#define DELTA_V_THRESHOLD2           (dV_dT2 * DELTA_TEMP_THRESHOLD2)
#define OV_TEMPERATURE_THRESHOLD_d2  ((V0_V2 + DELTA_V_THRESHOLD2)*INT_SUPPLY_VOLTAGE2)

#define DELTA_TEMP_HYSTERESIS2        (OV_TEMPERATURE_HYSTERESIS_C2)
#define DELTA_V_HYSTERESIS2           (dV_dT2 * DELTA_TEMP_HYSTERESIS2)
#define OV_TEMPERATURE_HYSTERESIS_d2  (DELTA_V_HYSTERESIS2*INT_SUPPLY_VOLTAGE2)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if (PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 != TURN_OFF)
#error "Error: HIGH_SIDE_IDLE_STATE2 in Driver parameters motor 2.h must be TURN_OFF."
#endif

#if !defined(HIGH_SIDE_BRAKE_STATE2)
#define HIGH_SIDE_BRAKE_STATE2 TURN_OFF
#endif

#if (HIGH_SIDE_BRAKE_STATE2 == TURN_OFF)
#if (PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_UH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_UH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_UH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_UH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_BRAKE_STATE2 == TURN_OFF)
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_VH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_VH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_VH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_VH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_BRAKE_STATE2 == TURN_OFF)
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_WH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_WH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define BRAKE_WH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY2 = H_ACTIVE_LOW */
#define BRAKE_WH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 != TURN_OFF)
#error "Error: LOW_SIDE_IDLE_STATE2 in Driver parameters motor 2.h must be TURN_OFF."
#endif

#if !defined(LOW_SIDE_BRAKE_STATE2)
#define LOW_SIDE_BRAKE_STATE2 TURN_OFF
#endif

