KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x motor 2.h
#if (LOW_SIDE_BRAKE_STATE2 == TURN_OFF)
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_UL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_UL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_UL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_UL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_BRAKE_STATE2 == TURN_OFF)
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_VL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_VL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_VL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_VL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_BRAKE_STATE2 == TURN_OFF)
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_WL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_WL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE2 = TURN_ON */
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define BRAKE_WL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY2 = L_ACTIVE_LOW */
#define BRAKE_WL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#undef PWM_TIM1
#undef PWM_TIM8
#define PWM_TIM1 0x1 /* Dummy value for comparison */
#define PWM_TIM8 0x8 /* Dummy value for comparison */
#if (PWM_TIMER_SELECTION2 == PWM_TIM1)
#define TIMx_UP_M2_IRQHandler TIM1_UP_TIM16_IRQHandler
#define TIMx_UP_M2_IRQFlag 0
#define TIMx_BRK_M2_IRQHandler TIM1_BRK_TIM15_IRQHandler
#endif
#if (PWM_TIMER_SELECTION2 == PWM_TIM8)
#define TIMx_UP_M2_IRQHandler TIM8_UP_IRQHandler
#define TIMx_UP_M2_IRQFlag 1
#define TIMx_BRK_M2_IRQHandler TIM8_BRK_IRQHandler
#endif
#undef PWM_TIM1
#undef PWM_TIM8

/* It is done here because the PWM_TIM1 and  PWM_TIM8 are above defined for 
   comparison */
#define PWM_TIM1			TIM1
#define PWM_TIM8                        TIM8
#define PWM_NO_REMAP		0 //Dummy
#define PWM_FULL_REMAP 		0 //Dummy
#define PWM_PARTIAL_REMAP 	0 //
#undef  PWM_TIMER_REMAPPING2
#define PWM_TIMER_REMAPPING2 PWM_NO_REMAP

/**********  SPEED FEEDBACK TIMERS SETTING *************/
#if (defined(HALL_SENSORS2) || defined(AUX_HALL_SENSORS2))
  #if (HALL_TIMER_SELECTION2 == HALL_TIM2)
  #define HALL_TIMER2 				TIM2  
  #define HALL_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
  #define HALL_IRQ_CHANNEL2  		TIM2_IRQn
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM3)
  #define HALL_TIMER2 				TIM3  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM3
  #define HALL_IRQ_CHANNEL2  		TIM3_IRQn  
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM4)
  #define HALL_TIMER2 				TIM4  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM4  
  #define HALL_IRQ_CHANNEL2  		TIM4_IRQn
  #elif (HALL_TIMER_SELECTION2 == HALL_TIM5)
  #define HALL_TIMER2 				TIM5  
  #define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM5
  #define HALL_IRQ_CHANNEL2  		TIM5_IRQn  
  #else
  #error "Hall parameters not defined in Control Stage parametes motor2.h"
  #endif
  #undef  HALL_TIMER_REMAPPING2
  #define HALL_TIMER_REMAPPING2  NO_REMAP_TIM2
#else
  /* Dummy value to avoid compiler error */
  #undef HALL_TIMER2
  #undef HALL_TIMER_REMAPPING2
  #undef HALL_RCC_PERIPHERAL2
  #undef HALL_IRQ_CHANNEL2
  #undef H1_GPIO_PORT2
  #undef H2_GPIO_PORT2
  #undef H3_GPIO_PORT2
  #undef H1_GPIO_PIN2
  #undef H2_GPIO_PIN2
  #undef H3_GPIO_PIN2
  #define HALL_TIMER2 				    TIM2
  #define HALL_TIMER_REMAPPING2  NO_REMAP_TIM2
  #define HALL_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2
  #define HALL_IRQ_CHANNEL2  		TIM2_IRQn
  #define H1_GPIO_PORT2          GPIOA
  #define H2_GPIO_PORT2          GPIOA
  #define H3_GPIO_PORT2          GPIOA
  #define H1_GPIO_PIN2           GPIO_Pin_0
  #define H2_GPIO_PIN2           GPIO_Pin_1
  #define H3_GPIO_PIN2           GPIO_Pin_2
#endif

#if (defined(ENCODER2) || defined(AUX_ENCODER2))
  #if (ENC_TIMER_SELECTION2 == ENC_TIM2)
  #define ENC_TIMER2 				TIM2  
  #define ENC_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
  #define ENC_IRQ_CHANNEL2  		TIM2_IRQn
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM3)
  #define ENC_TIMER2 				TIM3  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM3
  #define ENC_IRQ_CHANNEL2  		TIM3_IRQn  
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM4)
  #define ENC_TIMER2 				TIM4  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM4  
  #define ENC_IRQ_CHANNEL2  		TIM4_IRQn
  #elif (ENC_TIMER_SELECTION2 == ENC_TIM5)
  #define ENC_TIMER2 				TIM5  
  #define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM5
  #define ENC_IRQ_CHANNEL2  		TIM5_IRQn  
  #else
  #error "Encoder parameters not defined in Control Stage parametes motor2.h"
  #endif
  #undef  ENC_TIMER_REMAPPING2
  #define ENC_TIMER_REMAPPING2   NO_REMAP_TIM2
#else
  /* Dummy value to avoid compiler error */
  #undef  ENC_TIMER2
  #undef  ENC_TIMER_REMAPPING2
  #undef  ENC_RCC_PERIPHERAL2
  #undef  ENC_IRQ_CHANNEL2
  #undef  ENC_A_GPIO_PORT2
  #undef  ENC_B_GPIO_PORT2
  #undef  ENC_A_GPIO_PIN2
  #undef  ENC_B_GPIO_PIN2

  #define ENC_TIMER2 				    TIM2
  #define ENC_TIMER_REMAPPING2   NO_REMAP_TIM2
  #define ENC_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2
  #define ENC_IRQ_CHANNEL2  		  TIM2_IRQn
  #define ENC_A_GPIO_PORT2       GPIOA
  #define ENC_B_GPIO_PORT2       GPIOA
  #define ENC_A_GPIO_PIN2        GPIO_Pin_0
  #define ENC_B_GPIO_PIN2        GPIO_Pin_1
#endif

/* Resistive Brake */
#if (ON_OVER_VOLTAGE2 != TURN_ON_R_BRAKE)
  /* Dummy value to avoid compiler error */
  #undef R_BRAKE_GPIO_PORT2
  #undef R_BRAKE_GPIO_PIN2
  
  #define R_BRAKE_GPIO_PORT2    GPIOD
  #define R_BRAKE_GPIO_PIN2     GPIO_Pin_13
#endif

/* Hardware over current protection bypass */
#if (HW_OV_CURRENT_PROT_BYPASS2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef OV_CURR_BYPASS_GPIO_PORT2
  #undef OV_CURR_BYPASS_GPIO_PIN2
  
  #define OV_CURR_BYPASS_GPIO_PORT2  GPIOD        
  #define OV_CURR_BYPASS_GPIO_PIN2   GPIO_Pin_13
#endif

