KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x motor 2.h
/* Inrush current limiter */
#if (INRUSH_CURRLIMIT_ENABLING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef INRUSH_CURRLIMIT_GPIO_PORT2
  #undef INRUSH_CURRLIMIT_GPIO_PIN2
  
  #define INRUSH_CURRLIMIT_GPIO_PORT2  GPIOD
  #define INRUSH_CURRLIMIT_GPIO_PIN2   GPIO_Pin_10
#endif

/* Current sensing topology */
#if (defined(SINGLE_SHUNT2))
  /* Dummy value to avoid compiler error */
  #undef PHASE_U_CURR_ADC2
  #undef PHASE_U_CURR_CHANNEL2
  #undef PHASE_U_GPIO_PORT2
  #undef PHASE_U_GPIO_PIN2
  #undef PHASE_V_CURR_ADC2
  #undef PHASE_V_CURR_CHANNEL2
  #undef PHASE_V_GPIO_PORT2
  #undef PHASE_V_GPIO_PIN2
  #undef PHASE_W_CURR_ADC2
  #undef PHASE_W_CURR_CHANNEL2
  #undef PHASE_W_GPIO_PORT2
  #undef PHASE_W_GPIO_PIN2
  
  #define PHASE_U_CURR_ADC2                ADC1_2
  #define PHASE_U_CURR_CHANNEL2            ADC_Channel_11
  #define PHASE_U_GPIO_PORT2               GPIOC
  #define PHASE_U_GPIO_PIN2                GPIO_Pin_1
  #define PHASE_V_CURR_ADC2                ADC1_2
  #define PHASE_V_CURR_CHANNEL2            ADC_Channel_12
  #define PHASE_V_GPIO_PORT2               GPIOC
  #define PHASE_V_GPIO_PIN2                GPIO_Pin_2
  #define PHASE_W_CURR_ADC2                ADC1_2
  #define PHASE_W_CURR_CHANNEL2            ADC_Channel_13
  #define PHASE_W_GPIO_PORT2               GPIOC
  #define PHASE_W_GPIO_PIN2                GPIO_Pin_3
#elif (defined(ICS_SENSORS2))
  /* Dummy value to avoid compiler error */
  #undef PHASE_W_CURR_ADC2
  #undef PHASE_W_CURR_CHANNEL2
  #undef PHASE_W_GPIO_PORT2
  #undef PHASE_W_GPIO_PIN2
  
  #define PHASE_W_CURR_ADC2                ADC1_2
  #define PHASE_W_CURR_CHANNEL2            ADC_Channel_13
  #define PHASE_W_GPIO_PORT2               GPIOC
  #define PHASE_W_GPIO_PIN2                GPIO_Pin_3
  
  #undef PHASE_CURRENTS_ADC2
  #undef PHASE_CURRENTS_CHANNEL2
  #undef PHASE_CURRENTS_GPIO_PORT2
  #undef PHASE_CURRENTS_GPIO_PIN2
  
  #define PHASE_CURRENTS_ADC2              ADC3
  #define PHASE_CURRENTS_CHANNEL2          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT2        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN2         GPIO_Pin_2
#else
  /* Dummy value to avoid compiler error */
  #undef PHASE_CURRENTS_ADC2
  #undef PHASE_CURRENTS_CHANNEL2
  #undef PHASE_CURRENTS_GPIO_PORT2
  #undef PHASE_CURRENTS_GPIO_PIN2
  
  #define PHASE_CURRENTS_ADC2              ADC3
  #define PHASE_CURRENTS_CHANNEL2          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT2        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN2         GPIO_Pin_2
#endif

// Dummy for legacy WB - 3.0 Beta
#ifndef OCP_OUTPUT_GPIO_AF2
#define OCP_OUTPUT_GPIO_AF2 GPIO_AF_0
#endif
     
#ifndef OCPA_OUTPUT_GPIO_AF2
#define OCPA_OUTPUT_GPIO_AF2 GPIO_AF_0
#endif

#ifndef OCPB_OUTPUT_GPIO_AF2
#define OCPB_OUTPUT_GPIO_AF2 GPIO_AF_0
#endif

#ifndef OCPC_OUTPUT_GPIO_AF2
#define OCPC_OUTPUT_GPIO_AF2 GPIO_AF_0
#endif

#ifndef OVP_OUTPUT_GPIO_AF2
#define OVP_OUTPUT_GPIO_AF2 GPIO_AF_0
#endif

#if (TEMPERATURE_READING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef TEMP_FDBK_GPIO_PORT2
  #undef TEMP_FDBK_GPIO_PIN2
  #define TEMP_FDBK_GPIO_PORT2             GPIOA
  #define TEMP_FDBK_GPIO_PIN2              GPIO_Pin_1
#endif

#if (BUS_VOLTAGE_READING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef VBUS_GPIO_PORT2
  #undef VBUS_GPIO_PIN2
  #define VBUS_GPIO_PORT2                  GPIOA
  #define VBUS_GPIO_PIN2                   GPIO_Pin_1
#endif

#if ((defined HALL_SENSORS2) || (defined AUX_HALL_SENSORS2))
#if (HALL_TIMER_SELECTION2 == HALL_TIM2)
#define SPD_TIM_M2_IRQHandler TIM2_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM3)
#define SPD_TIM_M2_IRQHandler TIM3_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM4)
#define SPD_TIM_M2_IRQHandler TIM4_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM5)
#define SPD_TIM_M2_IRQHandler TIM5_IRQHandler
#else
#endif
#endif

#if ((defined ENCODER2) || (defined AUX_ENCODER2))
#if (ENC_TIMER_SELECTION2 == ENC_TIM2)
#define SPD_TIM_M2_IRQHandler TIM2_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM3)
#define SPD_TIM_M2_IRQHandler TIM3_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM4)
#define SPD_TIM_M2_IRQHandler TIM4_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM5)
#define SPD_TIM_M2_IRQHandler TIM5_IRQHandler
#else
#endif
#endif

#if (HALL_ICx_FILTER2 <= 1)
#define HALL_IC_FILTER2   0
#elif (HALL_ICx_FILTER2 <= 2)
#define HALL_IC_FILTER2   1
#elif (HALL_ICx_FILTER2 <= 6)
#define HALL_IC_FILTER2   2
#elif (HALL_ICx_FILTER2 <= 10)
#define HALL_IC_FILTER2   3
#elif (HALL_ICx_FILTER2 <= 14)
#define HALL_IC_FILTER2   4
#elif (HALL_ICx_FILTER2 <= 20)
#define HALL_IC_FILTER2   5
#elif (HALL_ICx_FILTER2 <= 28)
#define HALL_IC_FILTER2   6
#elif (HALL_ICx_FILTER2 <= 40)
#define HALL_IC_FILTER2   7
#elif (HALL_ICx_FILTER2 <= 56)
#define HALL_IC_FILTER2   8
#elif (HALL_ICx_FILTER2 <= 72)
#define HALL_IC_FILTER2   9
#elif (HALL_ICx_FILTER2 <= 88)
#define HALL_IC_FILTER2   10
#elif (HALL_ICx_FILTER2 <= 112)
#define HALL_IC_FILTER2   11
#elif (HALL_ICx_FILTER2 <= 144)
#define HALL_IC_FILTER2   12
#elif (HALL_ICx_FILTER2 <= 176)
#define HALL_IC_FILTER2   13
#elif (HALL_ICx_FILTER2 <= 224)
#define HALL_IC_FILTER2   14
#else
#define HALL_IC_FILTER2   15
#endif

#if (ENC_ICx_FILTER2 == 0)
#define ENC_IC_FILTER2   0
#elif (ENC_ICx_FILTER2 <= 2)
#define ENC_IC_FILTER2   1
#elif (ENC_ICx_FILTER2 <= 6)
#define ENC_IC_FILTER2   2
#elif (ENC_ICx_FILTER2 <= 10)
#define ENC_IC_FILTER2   3
#elif (ENC_ICx_FILTER2 <= 14)
#define ENC_IC_FILTER2   4
#elif (ENC_ICx_FILTER2 <= 20)
#define ENC_IC_FILTER2   5
#elif (ENC_ICx_FILTER2 <= 28)
#define ENC_IC_FILTER2   6
#elif (ENC_ICx_FILTER2 <= 40)
#define ENC_IC_FILTER2   7
#elif (ENC_ICx_FILTER2 <= 56)
#define ENC_IC_FILTER2   8
#elif (ENC_ICx_FILTER2 <= 72)
#define ENC_IC_FILTER2   9
#elif (ENC_ICx_FILTER2 <= 88)
#define ENC_IC_FILTER2   10
#elif (ENC_ICx_FILTER2 <= 112)
#define ENC_IC_FILTER2   11
#elif (ENC_ICx_FILTER2 <= 144)
#define ENC_IC_FILTER2   12
#elif (ENC_ICx_FILTER2 <= 176)
#define ENC_IC_FILTER2   13
#elif (ENC_ICx_FILTER2 <= 224)
#define ENC_IC_FILTER2   14
#else
#define ENC_IC_FILTER2   15
#endif

/*************** Encoder Alignemnt ************************/
    
