KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/SystemDriveParams/Parameters conversion_F30x motor 2.h
#ifdef AUX_STATE_OBSERVER_PLL2
  #define AUX_SCFG2 UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC2
  #define AUX_SCFG2 UI_SCODE_STO_CR
#endif

#ifdef ENCODER2
  #define MAIN_SCFG2 UI_SCODE_ENC
#endif

#ifdef HFINJECTION2
  #define MAIN_SCFG2 UI_SCODE_HFINJ
#endif

#ifdef VIEW_ENCODER_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS2
  #define MAIN_SCFG2 UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_HALL
#endif

#ifndef AUX_SCFG2
#define AUX_SCFG2 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE2 |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE2
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/
#ifdef DUALDRIVE
  #define UI_CONFIG_M2 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE2\
    | (MAIN_SCFG2 << MAIN_SCFG_POS) | (AUX_SCFG2 << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE2 )
#endif

#define OCP_OFFSET2 (((float)(OCP_V2)) * (OCP_R12/(OCP_R12 + OCP_R22)))
#define OCP_TH_V2 (OCP_OFFSET2 + ((float)(RSHUNT2)*OCP_THRESHOLD2)*(OCP_R22/(OCP_R12+OCP_R22)))
#define OCP_DAC_VREF2 (uint16_t)((OCP_TH_V2 * DAC_MAX_DIGIT)/DAC_VMAX)

#define OVP_DAC_VREF2 (uint16_t)(((float)(OV_VOLTAGE_THRESHOLD_V2)*(float)(VBUS_PARTITIONING_FACTOR2)*DAC_MAX_DIGIT)/DAC_VMAX)

#if (USE_INTERNAL_OPAMP2 == ENABLE)
#define R3_4_OPAMPPARAMSM2 &R3_4_F30XOPAMPParamsM2
#define R3_2_OPAMPPARAMSM2 &R3_2_F30XOPAMPParamsM2
#define R1_OPAMPPARAMSM2   &R1_F30XOPAMPParamsM2
#else
#define R3_4_OPAMPPARAMSM2 MC_NULL
#define R3_2_OPAMPPARAMSM2 MC_NULL
#define R1_OPAMPPARAMSM2   MC_NULL
#endif

#if (INTERNAL_OVERCURRENTPROTECTION2 == ENABLE)
#define OCPA_COMPPARAMSM2 &R3_F30XOCPACOMPParamsM2
#define OCPB_COMPPARAMSM2 &R3_F30XOCPBCOMPParamsM2
#define OCPC_COMPPARAMSM2 &R3_F30XOCPCCOMPParamsM2
#define OCP_COMPPARAMSM2  &R1_F30XOCPCOMPParamsM2
#else
#define OCPA_COMPPARAMSM2 MC_NULL
#define OCPB_COMPPARAMSM2 MC_NULL
#define OCPC_COMPPARAMSM2 MC_NULL
#define OCP_COMPPARAMSM2  MC_NULL
#endif

#if (INTERNAL_OVERVOLTAGEPROTECTION2 == ENABLE)
#define OVP_COMPPARAMSM2 &F30XOVPCOMPParamsM2
#else
#define OVP_COMPPARAMSM2 MC_NULL
#endif

#endif /*__PARAMETERS_CONVERSION_F30X_MOTOR2_H*/

/******************* (C) COPYRIGHT 2014 STMicroelectronics *****END OF FILE****/
